{
"recipes": [
{
    "recipeName": "Simple caprese salad",
    "recipeDescription": "A spin on the standard <a href=\"https://en.wikipedia.org/wiki/Caprese_salad\">caprese salad</a>.<br><br>\n              Traditionally, the caprese salad calls for sliced tomatoes and slices of mozzarella. This version uses cherry\n              tomatoes, and either mozzarella balls or small cubes of the cheese. This gives you a salad that's a bit more\n              like a salad, and works better as a side item. In addition, the cherry tomatoes are a bit sweeter, which\n              brings a little more brightness to the dish.<br><br>\n              The recipe below is designed to act as a guide, and not something to be followed prescriptively. Play with your\n              food! Adjust amounts based on your tastes.\n            ",
    "recipeImage": "https://milestone-2.netlify.app/images/caprese.jpeg",
    "ingredientList": [
      "10 cherry tomatoes",
      "3 oz <em>fresh</em> mozzarella",
      "6 basil leaves, <a href=\"https://en.wikipedia.org/wiki/Chiffonade\">chiffonade</a>",
      "2 Tbsp extra virgin olive oil",
      "1 Tbsp balsamic vinegar",
      "2 pinches of Kosher salt",
      "6 grinds of pepper"
    ],
    "steps": [
      "Pepare the tomatoes, mozzarella and basil as specified, and place in a medium-sized bowl.",
      "Season with salt and pepper.",
      "Add extra virgin olive oil and balsamic. Toss to coat.",
      "Adjust seasoning as needed.",
      "Serve!"
    ]
  },
  {
    "recipeName": "Loco Moco",
    "recipeDescription": "A spin on the standard <a href=\"https://en.wikipedia.org/wiki/Loco_moco\">loco moco</a>.<br><br>\n              Loco moco is a dish featured in contemporary Hawaiian cuisine. There are many variations, but \n              the traditional loco moco consists of white rice, topped with a hamburger, a fried egg, and brown \n              gravy. Variations may include bacon, ham, Spam, tofu, kalua pork, Portuguese sausage, teriyaki \n              beef, teriyaki chicken, mahi-mahi, shrimp, oysters, and other meats. <br>  <br>\n              The recipe below is designed to act as a guide, and not something to be followed prescriptively. Play with your\n              food! Adjust amounts based on your tastes.\n              ",
    "recipeImage": "https://milestone-2.netlify.app/images/loco-moco.jpeg",
    "ingredientList": [
      "2 (4 ounce) patties ground beef",
      "1 <em>pinch</em> of salt",
      "1 <em>pinch</em> of ground black pepper",
      "1 <em>pinch</em> of cayenne pepper",
      "2 eggs",
      "2 cups hot cooked white rice",
      "1.5 cups beef stock",
      "4 teaspoons soy sauce",
      "1 teaspoon Worcestershire sauce",
      "2 drops sesame oil",
      "2 teaspoons unsalted butter",
      "4 teaspoons cornstarch <em>to thicken</em>",
      "2 tablespoons minced green onions"
    ],
    "steps": [
      "Season patties with salt, pepper, and cayenne.",
      "Whisk beef stock, soy sauce, Worcestershire sauce, sesame oil, ketchup, sugar, and cornstarch together in a bowl.",
      "Melt butter in a skillet over medium-high heat. Cook patty in the hot skillet until a browned crust forms on the bottom, about 5 minutes. Flip; toss in green onions and cook the other side until both beef and onions are browned, 4 to 5 minutes more. Remove patty and most of the green onions to a plate.",
      "Pour beef stock mixture into the skillet. Stir, scraping up browned bits from the bottom, until thickened, about 2 minutes. Reduce heat to low and reserve gravy until needed.",
      "Melt remaining butter in another skillet over medium heat. Add eggs to the skillet and fry side-by-side until whites are set and yolks are still runny.",
      "Divide rice between 2 serving bowls. Place patties over the rice, spoon gravy on top, and add the fried eggs!"
    ]
  },
  {
    "recipeName": "Simple Pasta Primavera (Vegetarian)",
    "recipeDescription": "A spin on the standard <a href=\"https://en.wikipedia.org/wiki/Pasta_primavera\">Pasta Primavera</a>.<br><br>\n              In Italian, primavera means spring, and this classic warm-weather dish is surely a favorite this time of \n              year on account of its celebration of all things light and fresh. It takes little more than vibrant seasonal\n              vegetables to make a meal primavera style, but most traditional interpretations pair it with pasta.<br><br>\n              The recipe below is designed to act as a guide, and not something to be followed prescriptively. Play with your\n              food! Adjust amounts based on your tastes. (I didn't realize this image had a watermark until now LOL)\n            ",
    "recipeImage": "https://milestone-2.netlify.app/images/pasta-primavera.jpeg",
    "ingredientList": [
      "1 box Penne pasta",
      "1 Pinch of Salt",
      "2 Tbsp Olive Oil",
      "1 red onion",
      "0.5 cup chopped carrots",
      "0.5 cup chopped broccoli",
      "0.5 cup chopped bell peppers",
      "0.5 cup chopped zucchini",
      "0.5 cup chopped tomatoes",
      "2 Tbsp of garlic",
      "2 tsp dried Italian seasoning",
      "2 Tbsp fresh lemon juice",
      "2 Tbsp chopped fresh parsley",
      "1/2 cup shredded parmigiano, divided"
    ],
    "steps": [
      "First you’ll bring a large pot of water to a boil, add salt, then cook pasta according to package directions. Reserve 1/2 cup pasta water before draining.",
      " While the pasta is boiling cook the veggies so they will finish at the same time as the pasta. To do so, heat olive oil in a 12-inch (and deep) skillet over medium-high heat. Add red onion and carrot and sauté 2 minutes. Add broccoli and bell pepper then sauté 2 minutes. Add squash and zucchini then sauté 2 – 3 minutes or until veggies have nearly softened. Add garlic tomatoes, and Italian seasoning and sauté 2 minutes longer.",
      "Pour veggies into now empty pasta pot or a serving bowl, add drained pasta, drizzle in lemon juice, season with a little more salt as needed and toss while adding in pasta water to loosen as desired. Toss in 1/4 cup parmigiano and parsley ",
      "Add remaining parmesan on top!"
    ]
  }
]}