[
	{
		"name": "Braised Beef Noodle Soup",
		"description": "This braised beef noodle soup used Chinese dry aromatics and beef with marbled fat making a delicious rich beef noodle soup!",
		"image": "https://thewoksoflife.com/wp-content/uploads/2017/03/beef-noodle-soup-16.jpg",
		"ingredients": [
			"2 small pieces Chinese (cassia) cinnamon",
			"2 black cardamom pods",
			"½ tablespoon fennel seeds",
			"4 star anise pods",
			"10 cloves",
			"1 dried tangerine peel",
			"6 bay leaves",
			"½ tablespoon whole white peppercorns",
			"4 slices licorice root",
			"2 pieces sand ginger",
			"10 pieces dried amomum white cardamom",
			"3 pounds beef chuck (cut into large chunks)",
			"16 cups water",
			"5 slices ginger",
			"3 tablespoons oil",
			"15 grams rock sugar",
			"5 scallions (with the white and green parts separated)",
			"1 whole head of garlic (cloves peeled but kept whole)",
			"1 pound daikon (cut into ¼-inch thick slices, with each slice quartered)",
			"¼ cup Shaoxing wine",
			"1 tablespoon dark soy sauce",
			"¼ cup light soy sauce",
			"Salt (to taste)",
			"Noodle of your choice",
			"Leafy greens of your choice (spinach, romaine lettuce, choy sum, and bok choy are all good)",
			"Handful of chopped cilantro (optional)"
		],
		"instructions": [
			"First place the aromatics in a piece of cheesecloth tied tightly with kitchen string or disposable/fillable tea filter bags. That’s the cinnamon, black cardamom, fennel seeds, star anise, cloves, tangerine peel, bay leaves, white peppercorns, licorice slices, sand ginger, and amomum white cardamon.",
			"Next, rinse off the beef under cold running water. In a soup pot, add 16 cups of water, the ginger, and beef. Bring to a boil and cook for a few more minutes until you see some foam floating on the top of the water. Skim the foam off. You don’t want these impurities from the beef making your soup cloudy. Turn off the heat, fish out the pieces of beef, and strain the resulting broth through a fine-meshed strainer, into a heatproof bowl or other pot. Set aside, along with the ginger pieces.",
			"In another large, thick-bottomed soup pot, heat the oil over medium heat. Add the rock sugar, the white parts of the scallion, and the garlic. Cook for a few minutes until the scallions are lightly seared. Add the beef, turn up the heat, and mix everything well.",
			"Cook for about 5 minutes, and stir once or twice in between. Now add the Shaoxing wine, dark soy sauce, and light soy sauce, and stir everything together well so that the beef is coated in the soy sauce.",
			"Now add the aromatics, plus the daikon, and the broth and ginger pieces that you boiled the beef in. Bring everything to a boil and immediately turn the heat down to medium. Simmer for 90 minutes. The broth should be steadily simmering where you can see water moving in the pot, but not at a rolling boil.",
			"After 90 minutes, turn off the heat and let it stand (with the lid on) for another hour. Now your soup base is ready. Reheat, remove the aromatics, and add salt to taste before serving. Just remember, adding salt too early will dry out the beef.",
			"Cook the noodles according to the package instructions, strain, and transfer to a large serving bowl. Blanch a handful of your leafy greens of choice in the noodle water, and add it to the noodles. Then, ladle in the beef and the soup. Top with the chopped green parts of the scallions you set aside earlier and some chopped cilantro (optional). And if you really can’t resist a bit of spice, add a spoonful of chili oil.",
			"Enjoy!"
		]
	},
	{
		"name": "Tomato and Egg",
		"description": "This 10-minute Chinese tomato egg stir-fry is a dish you’ll find on many Chinese home dinner tables. It’s fast, easy, cheap, and delicious. And vegetarian!",
		"image": "https://thewoksoflife.com/wp-content/uploads/2019/05/tomato-egg-11.jpg",
		"ingredients": [
			"4 small to medium tomatoes (about 500 g, 1 pound)",
			"1 scallion",
			"4 eggs",
			"3/4 tsp salt (divided, or to taste)",
			"1/4 tsp white pepper",
			"1/2 tsp sesame oil",
			"1 tsp shaoxing wine",
			"3 tbsp vegetable oil (divided)",
			"2 tsp sugar",
			"1/4-1/2 cup water"
		],
		"instructions": [
			"Start by cutting tomatoes into small wedges and finely chop the scallion.",
			"Crack 4 eggs into a bowl and season with ¼ teaspoon salt, ¼ teaspoon white pepper, ½ teaspoon sesame oil, and 1 teaspoon Shaoxing wine. Beat eggs for a minute.",
			"Preheat the wok over medium heat until it just starts to smoke. Then add 2 tablespoons of oil and immediately add the eggs. Scramble the eggs and remove from the wok immediately. Set aside.",
			"Add 1 more tablespoon oil to the wok, turn up the heat to high, and add the tomatoes and scallions. Stir-fry for 1 minute, and then add 2 teaspoons sugar, ½ teaspoon salt, and ¼ cup water (if your stove gets very hot and liquid tends to cook off very quickly in your wok, add a little more water). Add the cooked eggs.",
			"Mix everything together, cover the wok, and cook for 1-2 minutes, until the tomatoes are completely softened.",
			"Uncover, and continue to stir-fry over high heat until the sauce thickens to your liking. Serve!"
		]
	},
	{
		"name": "Hot Dry Noodles (Re Gan Mian)",
		"description": "Traditional Hot Dry Noodles, or Re Gan Mian (热干面), a sesame noodle dish from Wuhan, capital of Hubei Province in China.",
		"image": "https://thewoksoflife.com/wp-content/uploads/2019/02/hot-dry-noodles-11.jpg",
		"ingredients": [
			"3 tablespoons sesame paste or tahini",
			"2 tablespoons sesame oil (plus 1 ½ teaspoons, divided)",
			"1 ½ teaspoons dark soy sauce",
			"1 tablespoon light soy sauce",
			"1/2 teaspoon sugar",
			"salt (to taste)",
			"240 g about 8 oz. fresh alkaline noodles",
			"1/4 cup chopped preserved mustard stems (or to taste)",
			"1/4 cup chopped pickled long beans (or to taste)",
			"1 teaspoon garlic (minced)",
			"Chili oil (to taste)",
			"1/4 cup cilantro (chopped)",
			"2 scallions (chopped)",
			"1/2 teaspoon Chinese black vinegar"
		],
		"instructions": [
			"Start by preparing the sauce. Add 3 tablespoons sesame paste to a bowl, and gradually stir in 2 tablespoons sesame oil to smooth out the paste.",
			"Then add 1 ½ teaspoons dark soy sauce and 1 tablespoon light soy sauce (or 4 ½ teaspoons of master sauce, if you have it). Add 1 teaspoon sugar, and stir until well combined. If the sauce is still too thick, add in a few drops of warm water or more master sauce to thin it out. Add salt to taste and set aside. You can prepare this sauce ahead of time.",
			"Boil a pot of water to cook the noodle as per package instructions, undercooking it by 1 minute to ensure they remain chewy and al dente. Drain. Shake off any excess liquid from the noodles, and put them in a large bowl.",
			"Toss the noodles with the remaining 1 ½ teaspoons sesame oil to prevent noodles from sticking together. Add in the preserved radish, pickled long beans, garlic, chili oil, cilantro, scallions, vinegar, and tahini sauce. Quickly toss the noodles together and serve hot."
		]
	}
]
